namespace _05.Supplies_for_School
{
    internal class Program
    {
        static void Main(string[] args)
        {
            //Учебната година вече е започнала и отговорничката на 10Б клас -Ани трябва да купи определен брой пакетчета с химикали, пакетчета с маркери,   както  и   препарат за почистване на дъска.
            //Тя е редовна клиентка на една книжарница, затова има намаление за нея, което представлява някакъв     процент от    общата  сума.
            //Напишете програма, която изчислява колко пари ще трябва да събере Ани, за да плати сметката, като имате предвид  следния ценоразпис:
            //•	Пакет химикали -5.80 лв.
            //•	Пакет маркери -7.20 лв.
            //•	Препарат - 1.20 лв(за литър)

            //От конзолата се четат 4 числа:
            //•	Брой пакети химикали - цяло число в интервала[0...100]
            //•	Брой пакети маркери - цяло число в интервала[0...100]
            //•	Литри препарат за почистване на дъска -цяло число в интервала[0…50]
            //•	Процент намаление -цяло число в интервала[0...100]


            //Да се отпечата на конзолата колко пари ще са нужни на Ани, за да си плати сметката.


            int neededPens = int.Parse(Console.ReadLine());
            int neededMarkes = int.Parse(Console.ReadLine());
            int neededLitersLiquid = int.Parse(Console.ReadLine());
            double percentDiscount = double.Parse(Console.ReadLine())/100.0;

            double totalSum = (neededPens * 5.80) + (neededMarkes * 7.20) + (neededLitersLiquid * 1.2);
            totalSum = totalSum - (totalSum * percentDiscount);

            Console.WriteLine(totalSum);




        }
    }
}